{
  "backend/main.mo": "Motoko backend actor implementing e-commerce functionality with product catalog, shopping cart per user (by Principal), and order management with persistent state in Maps.",
  "feature_evidence.json": "Feature evidence report documenting five implemented features: product catalog, shopping cart, checkout flow, category filtering, and skincare-themed UI design with associated files and test IDs.",
  "frontend-file-summaries.txt": "JSON object containing one-line summaries of all frontend source files including components, pages, hooks, and utilities for the skincare e-commerce application.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color variables for light and dark themes, defining sage green, cream, and terracotta palette for skincare aesthetic.",
  "frontend/index.html": "HTML entry point with root div and module script loading main.tsx for the Skincare Store application.",
  "frontend/src/App.tsx": "TanStack Router setup defining application routes (catalog, cart, checkout, order confirmation) with Layout as root component.",
  "frontend/src/components/CartItem.tsx": "Cart item component displaying product details with quantity controls (plus/minus buttons), remove functionality, and subtotal calculation.",
  "frontend/src/components/CategoryFilter.tsx": "Category filter component with buttons for all products, cleansers, moisturizers, serums, and masks with active state styling.",
  "frontend/src/components/HeroBanner.tsx": "Hero banner component with background image, gradient overlay, headline text, and scroll-to-products call-to-action button.",
  "frontend/src/components/Layout.tsx": "Root layout with sticky header containing logo and cart badge, main content outlet, and footer with branding, quick links, and social media icons.",
  "frontend/src/components/ProductCard.tsx": "React component that displays a product card with image, name, description, price, and an 'Add to Cart' button. Uses mutations to add items to cart and shows toast notifications on success or error.",
  "frontend/src/hooks/useActor.ts": "Custom hook that manages the ICP actor instance based on Internet Identity authentication state. Automatically creates anonymous or authenticated actors and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useCart.ts": "Custom hook that combines cart items with product details, calculating subtotals, total amount, and total item count. Returns enriched cart data with loading states.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout functionality. Manages authentication state, identity persistence, and delegation validity with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend operations including fetching products, managing cart (view, add), checkout, and adding products. Each mutation invalidates relevant queries on success.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom color palette (sage green, cream, terracotta) and CSS variables for light/dark themes. Defines design tokens for the application's visual identity.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/Cart.tsx": "Shopping cart page component that displays cart items, order summary with totals, and navigation buttons for checkout or continued shopping. Shows empty state when cart is empty.",
  "frontend/src/pages/Checkout.tsx": "Checkout page with a shipping information form that validates required fields and processes checkout via mutation. Redirects to order confirmation on success or shows error toasts on failure.",
  "frontend/src/pages/OrderConfirmation.tsx": "Order confirmation page that displays a success message with a checkmark icon, next steps information, and a button to continue shopping.",
  "frontend/src/pages/ProductCatalog.tsx": "Main product catalog page that displays products with category filtering, includes a hero banner, and initializes sample products if the database is empty.",
  "frontend/src/utils/imageHelpers.ts": "Utility functions that map product categories to their corresponding image URLs and provide the hero banner URL.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes (sage, cream, terracotta), animations, and design tokens for the skincare store theme.",
  "project_state.json": "Project metadata tracking implemented features including product catalog, shopping cart, checkout flow, category filtering, and visual design with natural skincare aesthetics."
}