{
  "backend/main.mo": "Main actor defining Product, CartItem, and Order types with CRUD operations for products, cart management, checkout flow, and initialization of a default 'Glow man face wash' product with ID 1.",
  "backend/migration.mo": "Migration module that ensures the default 'Glow man face wash' product (ID 1) is added to the products map if it doesn't already exist during actor upgrades.",
  "feature_evidence.json": "Feature evidence report documenting two high-confidence features related to investigating and fixing the 'Glow man face wash' product display issue and ensuring correct image mapping in imageHelpers.ts.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing React components, hooks, utilities, and pages with emphasis on product catalog, cart functionality, and image handling with debugging.",
  "frontend/index.css": "Tailwind CSS base styles with custom CSS variables defining OKLCH color system for light and dark themes using sage, cream, and terracotta palette.",
  "frontend/index.html": "HTML entry point with root div and module script loading main.tsx for the Skincare Store application.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for product catalog, cart, checkout, and order confirmation pages wrapped in Layout component.",
  "frontend/src/components/CartItem.tsx": "Cart item component displaying product image, name, price in rupees, quantity controls with increment/decrement buttons, remove functionality, and subtotal calculation.",
  "frontend/src/components/CategoryFilter.tsx": "Category filter component with buttons for 'All Products', 'Cleansers', 'Moisturizers', 'Serums', and 'Masks' to filter product catalog by category.",
  "frontend/src/components/HeroBanner.tsx": "Hero banner component displaying generated hero image with gradient overlay, headline text, description, and 'Shop Now' button that scrolls to products section.",
  "frontend/src/components/Layout.tsx": "Main layout component with sticky header containing logo/navigation, cart icon with badge showing item count, and footer with branding and social links. Uses TanStack Router for navigation and renders child routes via Outlet.",
  "frontend/src/components/ProductCard.tsx": "Product card component displaying product image, name, description, price, and category badge with an 'Add to Cart' button. Handles image loading errors and shows toast notifications on cart actions.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance based on Internet Identity authentication state. Invalidates and refetches dependent queries when the actor changes.",
  "frontend/src/hooks/useCart.ts": "Custom hook that combines cart items with product details, calculating subtotals, total amount, and total item count. Returns enriched cart data with loading states.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout flow, identity state, and AuthClient lifecycle. Provides authentication status and identity to child components.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for backend operations including fetching products (all or by category), viewing cart, adding to cart, checkout, adding products, and initializing default products. All hooks use the actor from useActor and invalidate relevant queries on mutations.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom color palette (sage green, cream, terracotta) defined as CSS variables for light and dark modes. Includes base styling for body and border elements.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the App component into the root DOM element.",
  "frontend/src/pages/Cart.tsx": "Shopping cart page component that displays cart items, order summary with totals, and navigation buttons for checkout or continuing shopping. Shows loading skeletons and empty cart state when appropriate.",
  "frontend/src/pages/Checkout.tsx": "Checkout page component with a shipping information form (name, email, address, city, postal code, country) and order summary. Validates form fields and submits checkout mutation on form submission.",
  "frontend/src/pages/OrderConfirmation.tsx": "Order confirmation page that displays a success message with a checkmark icon and next steps information after successful checkout. Provides a button to continue shopping.",
  "frontend/src/pages/ProductCatalog.tsx": "Main product catalog page that displays products with category filtering, hero banner, and handles initialization of default and sample products. Includes extensive logging for debugging product display issues.",
  "frontend/src/utils/imageHelpers.ts": "Utility functions for mapping product categories and specific products to their image URLs. Includes special handling for 'Glow man face wash' product and category-based image mapping with logging.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color palette (sage, cream, terracotta), container settings, border radius variables, animations, and typography/container-queries plugins for the skincare e-commerce theme.",
  "project_state.json": "Project state tracking file documenting the e-commerce platform's features, known issues (Glow man face wash not displaying), architectural notes, and requirement IDs. Currently at version 9 with isFixRequest flag set to true."
}