{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix Glow man face wash not displaying in product catalog",
  "requirements": [
    {
      "id": "REQ-11",
      "summary": "Investigate and fix why the 'Glow man face wash' product is not appearing in the product catalog display",
      "acceptanceCriteria": [
        "'Glow man face wash' product appears in the product catalog on the frontend",
        "Product displays with correct name, description, price (₹120), and image (glow-man-facewash.dim_800x800.png)",
        "Product can be added to cart successfully",
        "Product appears under the 'cleansers' category filter"
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/imageHelpers.ts",
          "operation": "modify",
          "description": "Verify and update getProductImage function to correctly map 'Glow man face wash' product name to frontend/public/assets/generated/glow-man-facewash.dim_800x800.png. Ensure the mapping handles exact product name matching including case sensitivity and spacing. Add console logging for debugging image path resolution."
        },
        {
          "path": "frontend/src/components/ProductCard.tsx",
          "operation": "modify",
          "description": "Add error handling for image loading failures and fallback behavior. Verify that the component correctly uses the imageHelpers utility to resolve the product image path. Add data attributes or console logging to help identify if products are being filtered out during rendering."
        },
        {
          "path": "frontend/src/pages/ProductCatalog.tsx",
          "operation": "modify",
          "description": "Add debugging console logs to verify that 'Glow man face wash' product is present in the products array returned from the backend query. Check if category filtering logic is inadvertently excluding the product. Ensure the CategoryFilter component correctly handles 'cleanser' vs 'cleansers' category names."
        }
      ]
    },
    {
      "id": "REQ-13",
      "summary": "Ensure the imageHelpers.ts utility correctly maps 'Glow man face wash' product to the glow-man-facewash.dim_800x800.png static asset",
      "acceptanceCriteria": [
        "getProductImage function in imageHelpers.ts returns correct path for 'Glow man face wash'",
        "Image file exists at frontend/public/assets/generated/glow-man-facewash.dim_800x800.png",
        "ProductCard component successfully renders the face wash product image"
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/imageHelpers.ts",
          "operation": "modify",
          "description": "Review and update the product name to image mapping logic. Ensure 'Glow man face wash' (with exact capitalization and spacing) maps to '/assets/generated/glow-man-facewash.dim_800x800.png'. Consider adding normalization logic (toLowerCase, trim) to handle slight name variations. Verify the mapping includes the .dim_800x800 dimension suffix in the filename as specified in the workspace asset path frontend/public/assets/generated/glow-man-facewash.dim_800x800.png."
        },
        {
          "path": "frontend/src/components/ProductCard.tsx",
          "operation": "modify",
          "description": "Verify that the ProductCard component properly calls imageHelpers to get the product image path and renders it in the img tag. Add onError handler to detect broken image paths and log the attempted image URL for debugging. Ensure the image src attribute uses the correct path format returned by getProductImage."
        }
      ]
    }
  ]
}